In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"Z:\ML\awards.csv")

In [3]:
df.head(5)

    id  num_awards  prog  math
0   45         1.0   3.0  41.0
1  108         1.0   NaN   NaN
2   15         1.0   3.0  44.0
3   67         NaN   3.0  42.0
4  153         1.0   3.0  40.0

In [4]:
df.tail(5)

    id  num_awards  prog  math
5   51         1.0   1.0   NaN
6  164         1.0   3.0  46.0
7  133         1.0   3.0  40.0
8    2         1.0   NaN  33.0
9   53         1.0   3.0  46.0

In [5]:
df[3:8]

    id  num_awards  prog  math
3   67         NaN   3.0  42.0
4  153         1.0   3.0  40.0
5   51         1.0   1.0   NaN
6  164         1.0   3.0  46.0
7  133         1.0   3.0  40.0

In [6]:
df[-5:]

    id  num_awards  prog  math
5   51         1.0   1.0   NaN
6  164         1.0   3.0  46.0
7  133         1.0   3.0  40.0
8    2         1.0   NaN  33.0
9   53         1.0   3.0  46.0

In [7]:
df[['id', 'math']][:4]

    id  math
0   45  41.0
1  108   NaN
2   15  44.0
3   67  42.0

In [8]:
df.math.value_counts()

46.0    2
40.0    2
33.0    1
42.0    1
44.0    1
41.0    1
Name: math, dtype: int64

In [9]:
df.columns = df.columns.str.upper()

In [10]:
df.columns

Index(['ID', 'NUM_AWARDS', 'PROG', 'MATH'], dtype='object')

In [11]:
df.rename(columns = {'PROG' : 'PROGRAM'})

    ID  NUM_AWARDS  PROGRAM  MATH
0   45         1.0      3.0  41.0
1  108         1.0      NaN   NaN
2   15         1.0      3.0  44.0
3   67         NaN      3.0  42.0
4  153         1.0      3.0  40.0
5   51         1.0      1.0   NaN
6  164         1.0      3.0  46.0
7  133         1.0      3.0  40.0
8    2         1.0      NaN  33.0
9   53         1.0      3.0  46.0

In [12]:
df.shape

(10, 4)